#include "user_tld7002.h"

//-------------------------------------------------------------------------------------------------------------------
//  函数简介      点阵屏显示字符
//  参数说明      brightness    设置的屏幕亮度 0-10000
//             *str   显示的字符内容
//  返回参数      void
//  使用示例      tld7002_display(5000,"OK ");
//-------------------------------------------------------------------------------------------------------------------
void tld7002_display(uint16 brightness,const char *str)
{
    // 设置点阵亮度
    dot_matrix_screen_set_brightness(brightness);
    // 设置显示内容
    dot_matrix_screen_show_string(str);
}
